# ColorName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..ColorName Property
ExportLayerInfo Class See Also
---
The color name stored in value. For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string that generates the colorNumber (for formats that don't use the color but need a second entry.)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string ColorName { get; set; }
```

Visual Basic
---
```text
Public Property ColorName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ColorName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace